/*
* Вычисления выполнить для пяти значений точности: 0.01, 0.001, 0.0001, 0.00001 и 0.000001. 
* 
* Вычислить определённый интеграл в пределах от a до b для четырех функций f1 = x, f2 = sin( 22 * x ), f3 = x^4 и f4 = arctg(x). 
* 
* Исследовать быстродействие алгоритма в зависимости от подынтегральной функции и требуемой точности 
* (быстродействие алгоритма можно оценить числом элементарных прямоугольников n, 
* при котором достигнута требуемая точность интегрирования)
*
*
*/

#include <iostream>

typedef double (*TPF)(double); // TPF == double (*)(double) (указатель на подынтегральную функцию)

//qwe

double IntRect(double a, double b, double eps, int& n)
{
	return;
}

double IntTrap()
{
	return;
}

int main()
{	
	
	return 0;
}